import os
import json

original_cities = {'1': '山西',
 '2': '天津',
 '3': '安徽',
 '4': '中国安徽',
 '5': '山东',
 '6': '安徽省六安市',
 '7': '河南',
 '8': '重庆',
 '9': '广西',
 '10': '贵州',
 '11': '甘肃',
 '12': '湖南',
 '13': '陕西',
 '14': '山西省',
 '15': '湖北',
 '16': '浙江',
 '17': '云南',
 '18': '汉',
 '19': '河南省',
 '20': '河北',
 '21': '吉林',
 '22': '山西介休',
 '23': '海南省',
 '24': '黑龙江',
 '25': '山西省临汾市',
 '26': '辽宁',
 '27': '河南濮阳',
 '28': '福建',
 '29': '河南新蔡',
 '30': '山西省长治市',
 '31': '宁夏',
 '32': '山东省',
 '33': '宁夏银川市',
 '34': '四川',
 '35': '四川省',
 '36': '安徽省',
 '37': '山西太原',
 '38': '湖南常德',
 '39': '湖南省',
 '40': '陕西西安',
 '41': '江西赣州',
 '42': '安徽省合肥市',
 '43': 'Shandong',
 '44': '江苏泰州',
 '45': 'Jiangxi',
 '46': '辽宁抚顺',
 '47': '新疆',
 '48': 'Chongqing',
 '49': 'Hebei',
 '50': '江苏',
 '51': '青海',
 '52': '甘肃靖远',
 '53': '广东',
 '54': '山西长治',
 '55': '内蒙古',
 '56': '河北省',
 '57': '安徽省安庆市',
 '58': '甘肃武威',
 '59': '山东省临沂市',
 '60': '辽宁锦州',
 '61': '辽阳',
 '62': 'Hubei',
 '63': '江苏扬州',
 '64': '辽宁省朝阳市',
 '65': '辽宁省辽阳市',
 '66': '朝阳',
 '67': '东北',
 '68': '辽宁省锦州市',
 '69': '烟台',
 '70': '吉林省扶余县',
 '71': '福建省泉州市',
 '72': '鞍山',
 '73': '辽宁省',
 '74': '辽宁省大连市',
 '75': '辽宁省丹东市',
 '76': 'Neimenggu',
 '77': '辽宁省抚顺市',
 '78': '辽宁大连',
 '79': '沈阳市',
 '80': '贵州贵阳',
 '81': '四川南充',
 '82': '内蒙古赤峰市',
 '83': '山西省阳泉市',
 '84': '辽宁省沈阳市',
 '85': '辽宁省朝阳市建平县',
 '86': '甘肃酒泉',
 '87': '辽宁省朝阳区',
 '88': '辽宁省大连市庄河市',
 '89': '辽宁省凌源市',
 '90': '辽宁省营口市',
 '91': '陕西汉中',
 '92': '广东茂名',
 '93': '辽宁朝阳',
 '94': '大连',
 '95': '云南昆明',
 '96': '葫芦岛',
 '97': '黑龙江齐齐哈尔',
 '98': '黑龙江省齐齐哈尔市',
 '99': '辽宁省本溪市',
 '100': '沈阳',
 '101': '大连市',
 '102': '内蒙',
 '103': 'Shanxi',
 '104': '山东省枣庄市薛城区',
 '105': '贵州省',
 '106': '河南郑州',
 '107': 'Anhui',
 '108': '甘肃省',
 '109': '广西桂林龙胜',
 '110': '江西',
 '111': 'shanx',
 '112': '上海',
 '113': '天津市',
 '114': '山东济南',
 '115': '吉林省',
 '116': '北京',
 '117': '山西省晋中市',
 '118': '海南',
 '119': '河北省张家口市',
 '120': '广东省梅州市',
 '121': '天津市蓟县',
 '122': '苏',
 '123': '河北省衡水市',
 '124': '甘肃省天水市',
 '125': 'Jilin',
 '126': '山西晋中',
 '127': '山西省大同市',
 '128': 'Sichuan',
 '129': '山东青岛',
 '130': '汉族',
 '131': '石家庄',
 '132': '陕西渭南',
 '133': '河北沧州',
 '134': '山东德州'}

new_cities = {
'1': '山西',
'2': '天津',
'3': '安徽',
'4': '安徽',
'5': '山东',
'6': '安徽',
'7': '河南',
'8': '重庆',
'9': '广西',
'10': '贵州',
'11': '甘肃',
'12': '湖南',
'13': '陕西',
'14': '山西',
'15': '湖北',
'16': '浙江',
'17': '云南',
'18': '汉',
'19': '河南',
'20': '河北',
'21': '吉林',
'22': '山西',
'23': '海南',
'24': '黑龙江',
'25': '山西',
'26': '辽宁',
'27': '河南',
'28': '福建',
'29': '河南',
'30': '山西',
'31': '宁夏',
'32': '山东',
'33': '宁夏',
'34': '四川',
'35': '四川',
'36': '安徽',
'37': '山西',
'38': '湖南',
'39': '湖南',
'40': '陕西',
'41': '江西',
'42': '安徽',
'43': '山东',
'44': '江苏',
'45': '江西',
'46': '辽宁',
'47': '新疆',
'48': '重庆',
'49': '河北',
'50': '江苏',
'51': '青海',
'52': '甘肃',
'53': '广东',
'54': '山西',
'55': '内蒙古',
'56': '河北',
'57': '安徽',
'58': '甘肃',
'59': '山东',
'60': '辽宁',
'61': '辽阳',
'62': '湖北',
'63': '江苏',
'64': '辽宁',
'65': '辽宁',
'66': '辽宁',
'67': '东北',
'68': '辽宁',
'69': '烟台',
'70': '吉林',
'71': '福建',
'72': '鞍山',
'73': '辽宁',
'74': '辽宁',
'75': '辽宁',
'76': '内蒙古',
'77': '辽宁',
'78': '辽宁',
'79': '辽宁',
'80': '贵州',
'81': '四川',
'82': '内蒙古',
'83': '山西',
'84': '辽宁',
'85': '辽宁',
'86': '甘肃',
'87': '辽宁',
'88': '辽宁',
'89': '辽宁',
'90': '辽宁',
'91': '陕西',
'92': '广东',
'93': '辽宁',
'94': '大连',
'95': '云南',
'96': '葫芦岛',
'97': '黑龙江',
'98': '黑龙江',
'99': '辽宁',
'100': '辽宁',
'101': '辽宁',
'102': '内蒙',
'103': '山西',
'104': '山东',
'105': '贵州',
'106': '河南',
'107': '安徽',
'108': '甘肃',
'109': '广西',
'110': '江西',
'111': '山西',
'112': '上海',
'113': '天津',
'114': '山东',
'115': '吉林',
'116': '北京',
'117': '山西',
'118': '海南',
'119': '河北',
'120': '广东 120',
'121': '天津',
'122': '苏州',
'123': '河北',
'124': '甘肃',
'125': '吉林',
'126': '山西',
'127': '山西',
'128': '四川',
'129': '山东',
'130': '汉',
'131': '石家庄',
'132': '陕西',
'133': '河北',
'134': '山东'
}

# Merge two dictionaries into a new one
original_city_to_new_city = {original_cities[key]: new_cities[key] for key in original_cities}

# Print out the result
print(original_city_to_new_city)

# 你的目标文件夹
directory = r'C:\Users\18201\Downloads\ST-CMDS-20170001_1-OS\ST-CMDS-20170001_1-OS'

# 城市名称映射


for filename in os.listdir(directory):
    if filename.endswith(".metadata"):
        # 获取文件的完整路径
        file_path = os.path.join(directory, filename)

        try:
            # 尝试用utf-8编码打开文件
            with open(file_path, 'r', encoding='utf-8') as file:
                lines = file.readlines()
        except UnicodeDecodeError:
            # 如果报错，则尝试用gbk编码打开文件
            with open(file_path, 'r', encoding='gbk') as file:
                lines = file.readlines()

        # 对每一行进行处理
        for i in range(len(lines)):
            # 如果城市名在我们的映射中，我们就更新它
            # 注意，我们现在需要把 "BIR " 去掉才能得到城市名
            line = lines[i]
            if line.startswith('BIR'):
                city = line.split(' ')[1].strip()
                if city in original_city_to_new_city:
                    lines[i] = "BIR " + original_city_to_new_city[city] + '\n'

        # 将更新后的数据写回文件
        with open(file_path, 'w', encoding='utf-8') as file:
            file.writelines(lines)

# 遍历文件夹中的所有文件，重新计算城市的数量
city_counts = {}
for filename in os.listdir(directory):
    if filename.endswith(".metadata"):
        # 获取文件的完整路径
        file_path = os.path.join(directory, filename)

        with open(file_path, 'r', encoding='utf-8') as file:
            lines = file.readlines()

        # 对每一行进行处理
        for line in lines:
            # 计算城市的数量
            if line.startswith('BIR'):
                city = line.split(' ')[1].strip()
                if city in city_counts:
                    city_counts[city] += 1
                else:
                    city_counts[city] = 1

# 打印城市和它们的数量
for city, count in city_counts.items():
    print(f'{city}: {count}')